https://github.com/okovtun/P_418.git
https://www.youtube.com/playlist?list=PLeqyOOqxeiIMOOtQKRjb1MLc31Bh7a_Hc

TODO:
1. Выучить теорию по системам контроля версий;
2. Прислать ссылку на свой GotHub, страница 'Repositories';

DONE:
0. Выучить теорию по системам контроля версий;
1. В Solution 'ControlStructures' добавить проект 'ChessBoard' и в нем:
	https://github.com/okovtun/P_418/blob/master/ControlStructures/Picture/ChessBoard.jpg
		Клетки этой шахматной доски нужно вывести при помощи Тернарного оператора.
		
2. В Solution 'ControlStructures' добавить проект 'HardChess' и в нем:
	https://github.com/okovtun/P_418/blob/master/ControlStructures/Picture/HardChess.jpg

3. Вывести на экран треугольник Паскаля. Глубину треугольника пользователь вводит с клавиатуры;
4. Десятичное число, введенное с клавиатуры перевести в Шестнадцатеричную систему счисления;

TODO:
В Solution 'ControlStructures' добавить проект 'Geometry' и в нем решить следующие задачи:
Пользователь вводит размер фигуры, и программа выводит на экран следующие фигуры:

	* * * * * 
	* * * * * 
	* * * * * 
	* * * * * 
	* * * * * 

	*
	* * 
	* * * 
	* * * *
	* * * * *

	* * * * *
	* * * *
	* * *
	* *
	*

	* * * * *
	  * * * *
	    * * *
		  * *
		    *

			*
		  * *
		* * *
	  * * * *
	* * * * *

	    /\
	   /  \
	  /    \
	 /      \
	/        \
	\        /
	 \      /
	  \    /
	   \  /
	    \/

DONE:
1. DONE Shooter должен быть регистронезависимым, и кроме WASD должен реагировать на клавиши курсора (стрелки)
		Все следующие задачи решить в проекте 'FOR':
2. DONE Написать программу, которая вычисляет факториал числа, введенного с клавиатуры.
   Факториал - это произведение ряда чисел от 1 до указанного включительно, например:
	5! = 1*2*3*4*5 = 120;
3. DONE Пользватель вводит основание и показатель степени, и программа вычисляет степень.
	Степень - это умножение числа на себя заданное колиество раз;
4. DONE Вывести на экран таблицу ASCII-символов по 16 символов в строке,
	символы должны раделяться пробелом;
5. DONE Вывести на экран ряд Фибоначчи до указанного предела;
6. DONE Вывести на экран заданное количество чисел из ряда Фибоначчи;
	Ряд Фибоначчи строится из двух чисел - 0 и 1.
	Каждый следующий член ряда - это сумма двух предыдущих членов ряда
		0	1	1	2	3	5	8	13	21	........
7. DONE Вывести на экран ряд простых чисел до указанного предела, который ввел пользователь.
	Простым называется натуральное число, 
	которое делится без остатка только на себя и на единицу.
8. DONE Вывести на экран ряд совершенных чисел ***(Попробовать сделать через число Мерсена)***;
9. DONE Вывести на экран таблицу Пифагора;

DONE:
1. Почитать про длинную арифметику;

DONE:
Реализовать 'Shooter' при помощи 'switch';

DONE:
В Solution 'ControlStructures' добавить проект 'Shooter', и в этом проекте,
программа должна выводить на экран действия пользователя, в зависимости от нажатой клавиши:
	w - вперед
	s - назад
	a - влево
	d - вправо
	space - прыжок
	enter - огонь
	escape - выход (работа программы действительно должна завершаться)

DONE:
1. Законспектировать циклы while и do...while:
	https://github.com/okovtun/P_418/blob/master/DataTypes.pdf;
2. В Solution 'ControlStructures' добавить проект 'Palindrome', и в этом проекте,
   пользователь вводит число, и программа говорит, является ли это число Палиндромом.
   Палиндром - это число, которое чистается одинаково как слева нправо, так и справа налево;
3. В Solution 'ControlStructures' добавить проект 'Ticket', и в этом проекте,
   пользователь вводит номер автобусного билета, и программа говорит, 
   этот блет счастливый, или обычный.
   Счастливым считается билет, у которого сумма трех старших разрядов равна сумме трех младших разрядов;

DONE:
0. !!!	Выучить теорию по операторам	!!!
1. Написать калькулятор, который принимает выражение вида:
	2+3
	и выводит на экран результат арифметической операции (+, -, *, /);

DONE:
0. !!!	Выучить теорию по операторам	!!!
1. Следующие задачи нужно решить без VisualStudio:
1.1
	int i = 3;
	i = ++i + i++;
	cout << i << endl;	
1.2
	int i = 3;
	i = ++i + ++i;
	cout << i << endl;
1.3
	int i = 3;
	i = i++ + 1 + ++i * 2;
	cout << i << endl;
1.4
	int i = 3;
	i = i++ + 1 + ++i *= 2;
	cout << i << endl;
1.5
	int i = 3;
	i += i++ + 1 + ++i *= 2;
	cout << i << endl;



DONE:
0. !!! Выучить теорию по типам данных !!!
1. Пользователь вводит с клавиатуры 2 числа (например a=22   b=33), они сохраняются в переменные 'a' и 'b'.
   Нужно написать код, который меняет местами содержимое этих переменных;

DONE:
1. Вывести в консоль объем занимаемой памяти и 
   диапазоны принимаемых значений для всех числовых типов данных;
2. Решить задачи из файла:
	https://github.com/okovtun/P_418/blob/master/VariablesTask.pdf

DONE:
1. Выучить теорию;
2. Вывести в консоль стишок "В лесу родилась Ёлочка".
   Стишок должен быть выровнен по середине окна консоли
   и его куплеты должны разделяться пустой строкой