#include<iostream>
using namespace std;

void main()
{
	setlocale(LC_ALL, "");
	//cout << "Hello Pointers" << endl;
	//			C/C++
	int a = 2;			//Объявление и инициализация переменной 'a';
	int* pa = &a;		//Объявление и инициализация указателя 'pa';
	cout << a << endl;	//Вывод значения переменной 'a' на экран;
	cout << &a << endl;	//Взятие адреса переменной 'a' прямо при выводе;
}

/*
---------------------------------------
Указатель (Pointer) - это переменная, которая содержит адрес.
Адрес - это число, длиной 4 Байта, означающее порядковый номер Байте в ОЗУ.
---------------------------------------
& - Оператор взятия адреса (Address-of operator);
*
---------------------------------------
*/