#include<iostream>
using namespace std;

void main()
{
	setlocale(LC_ALL, "");
	
	int n = 5;
	
	for (int i = 0;
		i < n;
		i++)
	{
		cout << i << "\t";
	}
	cout << endl;
}
/*
--------------------------------------------
for - это цикл на заданное число итераций.
--------------------------------------------
*/

/*
------------------------------------------
for (counter; condition; expression)
{
	.....;
	group - of - statements;
	.....;
}

counter		- это счетчик цикла, это переменная,
			  которая считает сколько раз выполнился,
			  или будет выполнен цикл.
			  !!! ВЫРАЖЕНИЕ 'counter' ОТРАБАТЫВАЕТ ОДИН РАЗ - ПЕРЕД ПЕРВОЙ ИТЕРАЦИЕЙ !!!

condition	- это условие продолжения, или завершения цикла.
			  УСЛОВИЕ ПРОВЕРЯЕТСЯ ПЕРЕД КАЖДОЙ ИТЕРАЦИЕЙ !!!

expression  - это выражение, которое изменяет счетчик.
			  В этом выражении можно писать абсолютно все что угодно, но
			  как правило здесь пишут Increment/Decrement счетчика.

			  Expression ОТРАБАТЫВАЕТ ПОСЛЕ КАЖДОЙ ИТЕРАЦИИ !!!
------------------------------------------
*/