//DynamicMemory
#include<iostream>
using namespace std;

#define tab "\t"

void FillRand(int arr[], const int n);
void Print(int arr[], const int n);

void main()
{
	setlocale(LC_ALL, "");
	cout << "DynamicMemory" << endl;
	int n = 5;
	cout << "Введите размер массива: "; cin >> n;
	///////////////////////////////////////////////////
	///			(1) Выделение памяти:				///
	///////////////////////////////////////////////////
	int* arr = new int[n];

	///////////////////////////////////////////////////
	///			(2) Использование памяти:			///
	///////////////////////////////////////////////////
	FillRand(arr, n);
	Print(arr, n);

	//Добавление значения в конец массива:
	int value;	//добавляемое значение
	cout << "Введите добавляемое значение: "; cin >> value;

	//1) Создаем буферный массив нужного размера:
	int* buffer = new int[n + 1];

	//2) Копируем значения из исходного массива в буферный:
	for (int i = 0; i < n; i++)
	{
		buffer[i] = arr[i];
	}

	//3) Удаляем исходный массива:
	delete[] arr;

	//4) Подменяем адрес исходного массива адресом нового (буферного массива):
	arr = buffer;

	//5) И только после всего этого в массиве 'arr' появляется элемент, в который можно сохранить добавляемое значение:
	arr[n] = value;

	//6) После того как в массив добавился еще один элемент, количество элементов массива увеличивается на 1:
	n++;

	//7) Mission complete, happy tomorrow:
	Print(arr, n);

	///////////////////////////////////////////////////
	///				(3)Удаление памяти:				///
	///////////////////////////////////////////////////
	delete[] arr;

	//Memory leak
}

void FillRand(int arr[], const int n)
{
	for (int i = 0; i < n; i++)
	{
		//Оператор индексирования (Subscript operator) []:
		arr[i] = rand() % 100;
	}
}
void Print(int arr[], const int n)
{
	for (int i = 0; i < n; i++)
	{
		//Обращение к элементам массива при помощи арифметики указателей и оператора разыменования:
		cout << *(arr + i) << tab;
	}
	cout << endl;
}